import numpy as np

# ใช้ทำงานเหมือนกับ list สามารถที่จะระบุช่วงสมาชิกได้


arr = np.arange(1,10)
print(arr)
print(arr[-7])


# slice คือการระบุสมชิกข้อมูลใน array เช่นถ้าอยากได้ค่ากว่า 1 

# 5 pattren

#1 จะแสดงค่าทั้งหมด#ไม่แสดงค่าอะไรเลย
print(arr[:])
#2 start ระบุจุดเริ่มต้นที่ตำแหน่ง
print(arr[4:])
#3 goal ระบุจุดสุดท้ายของตำแหน่ง#คือสินสุด #นับเริ่มจาก 0 # เอาเลขสุดท้ายมา ลบ ออก 1
print(arr[:8])

arr1 = np.array([1,2,3,4,5,6,7,8,9])
print(arr1[4:])  # 5,6,7,8,9
print(arr1[:4]) # 1,2,3,4
print(arr1[1:9]) # 2-8+1 = 9 => 2-9 นั้นเอง
print(arr1[:5]) # 1-4-1 = 1-3
print(arr1[:3]) # 1-6 นับเกิน 1 ลบออก 1

# [start:stop:step]

arr2 = np.array([10,11,12,13,14,15,16,17,18,19,20])
print(arr2[1:10:2]) # หาเลขคี่ใน array
print(arr2[0:10:2]) # หาเลขคู่ใน array
print(arr2[::2]) # ระบุแค่สเต็ป 