import numpy as np

# index array
# มี2ส่วนคือ row/colum

# โจทย์จงใช้ตัวดำเนินการทางคณิตศาสตร์ทั้งหมดในเพื่อหาค่าทั้งหมดใน array 2มิติ

arr = np.array([[100,90,1000,300]
,[40,50,70,30,500],
[1,3,5,6,8,9]])
# consep array 2 miti จะนับรวมข้อมูลทั้งชุด


#["row"]and["colum"] ####$##[row]start 0-.../ [colum]stort 0-..

#print(arr[0][0])
#print(arr[1][1])
#print(arr[2][2])

# การบวกค่าของ nummerict Python = > numpy
# array 2 มิติ
print("ผลลัทธ์ในการ (+) ค่าทั้งของตัว arr ",arr[0][-1]+arr[0][-3]+arr[0][-2]+arr[0][-1]+arr[1][-5]+arr[1][-4]+arr[1][-3]+arr[1][-2]+arr[1][-1]
+arr[2][-1]+arr[2][-2]+arr[2][-3]+arr[2][-4]+arr[2][-5]+arr[2][-6])

print("ผลลัทธ์ในการ (-) ค่าทั้งของตัว arr ",arr[0][-1]-arr[0][-3]-arr[0][-2]-arr[0][-1]-arr[1][-5]-arr[1][-4]-arr[1][-3]-arr[1][-2]-arr[1][-1]
-arr[2][-1]-arr[2][-2]-arr[2][-3]-arr[2][-4]-arr[2][-5]-arr[2][-6])
#print("result = ",arr[0][-2]+arr[1][-1]+arr[2][-2])
#print("result = ",arr[0][0]+arr[1][1]+arr[2][2])
print("ผลลัทธ์ในการ (*) ค่าทั้งของตัว arr",arr[0][-1]*arr[0][-3]*arr[0][-2]*arr[0][-1]*arr[1][-5]*arr[1][-4]*arr[1][-3]*arr[1][-2]*arr[1][-1]
*arr[2][-1]*arr[2][-2]*arr[2][-3]*arr[2][-4]*arr[2][-5]*arr[2][-6])

print("ผลลัทธ์ในการ (/) ค่าทั้งของตัว arr",arr[0][-1]/arr[0][-3]/arr[0][-2]/arr[0][-1]/arr[1][-5]/arr[1][-4]/arr[1][-3]/arr[1][-2]/arr[1][-1]
/arr[2][-1]/arr[2][-2]/arr[2][-3]/arr[2][-4]/arr[2][-5]/arr[2][-6])

print("ผลลัทธ์ในการ (%) ค่าทั้งของตัว arr",arr[0][-1]%arr[0][-3]%arr[0][-2]%arr[0][-1]%arr[1][-5]%arr[1][-4]%arr[1][-3]%arr[1][-2]%arr[1][-1]
%arr[2][-1]%arr[2][-2]%arr[2][-3]%arr[2][-4]%arr[2][-5]%arr[2][-6])

print("ผลลัทธ์ในการ (**) ค่าทั้งของตัว arr ",arr[0][-1]**arr[0][-3]**arr[0][-2]**arr[0][-1]**arr[1][-5]**arr[1][-4]**arr[1][-3]**arr[1][-2]**arr[1][-1]
**arr[2][-1]**arr[2][-2]**arr[2][-3]**arr[2][-4]**arr[2][-5]**arr[2][-6])

print("ผลลัทธ์ในการ (//) ค่าทั้งของตัว arr ",arr[0][-1]//arr[0][-3]//arr[0][-2]//arr[0][-1]//arr[1][-5]//arr[1][-4]//arr[1][-3]//arr[1][-2]//arr[1][-1]
//arr[2][-1]//arr[2][-2]//arr[2][-3]//arr[2][-4]//arr[2][-5]//arr[2][-6])

